"""
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；

利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；

20万到40万之间时，高于20万元的部分，可提成5%；

40万到60万之间时高于40万元的部分，可提成3%；

60万到100万之间时，高于60万元的部分，可提成1.5%；

高于100万元时，超过100万元的部分按1%提成。

从键盘输入当月利润I，求应发放奖金总数？
"""

def method001():
    i = float(input("请输入当月利润(单位万元): "))
    if i <= 10:
        bonus = i * 0.1
        print("发放奖金总数为：%.2f" % bonus)
    elif (i > 10) and (i <= 20):
        bonus = 10 * 0.1 + (i - 10) * 0.075
        print("发放的奖金数为:%.2f" % bonus)
    elif (i > 20) and (i <= 40):
        bonus = 10 * 0.1 + 10 * 0.075 + (i - 20) * 0.05
        print("发放的奖金数为:%.2f" % bonus)
    elif (i > 40) and (i <= 60):
        bonus = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (i - 40) * 0.03
        print("发放的奖金数为:%.2f" % bonus)
    elif (i > 60) and (i <= 100):
        bonus = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015
        print("发放的奖金数为:%.2f" % bonus)
    else:
        bonus = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (i - 100) * 0.01
        print("发放的奖金数为:%.2f" % bonus + "万元")


def method002():
    i = float(input("请输入当月利润（单位万元）："))
    bonus = 0
    profit = [100, 60, 40, 20, 10, 0]
    rate = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
    for x in range(0, 6):
        if i > profit[x]:
            bonus += (i-profit[x]) * rate[x]
            i = profit[x]
    print("发放的奖金数为:%.2f" % bonus + "万元")


if __name__ == "__main__":
    method002()
